//Вероятнее всего, релизить мы будем R*, так как он более эффективный, но сложно быть не должно
//Ссылка на эту дичь https://habr.com/ru/post/224965/

//Узел дерева
template <class T>
struct Node{
    //Я еще смутно представляю структуру узлов этого дерева, но что-то придумаем
};

//Само дерево
template <class T>
class rTree {
private:

public:
    //TODO: Алгоритм выбора поддерева (chooseSubtree)

    //TODO: Алгоритм деления узла (splitNode)

    //TODO: Собственно сама вставка (insertObject)

    //TODO: Поиск объектов в заданом радиусе (findObjectsInArea)

    //TODO: Так же, если я не ошибаюсь, R* требует регулировки некоторых параметров при splitNode
};
